stress/artillery/socketio-chat-load-test.yaml
config:
  target: "http://0.0.0.0:8080/"
  phases:
    - duration: 3
      arrivalRate: 1
    # - duration: 10
    #   arrivalRate: 5
  variables:
    greeting: ["hello", "goedemorgen", "добрый день", "guten tag", "bonjour", "hola"]
  processor: "./functions.js"

scenarios:
  - name: "test for login"
    engine: socketio
    flow:
      - emit:
          channel: "login"
          data: {"username": "testuser", "password": "testpw"}
  # - name: "A user that just lurks"
  #   weight: 75
  #   engine: "socketio"
  #   flow:
  #     - get:
  #         url: "/"
  #     - emit:
  #         channel: "create user"
  #         data: "lurker-{{$randomString()}}"
  #     - think: 60

  # - name: "A mostly quiet user"
  #   weight: 15
  #   engine: "socketio"
  #   flow:
  #     - get:
  #         url: "/"
  #     - emit:
  #         channel: "add user"
  #         data: "quiet-{{ $randomString() }}"
  #     - think: 5
  #     - emit:
  #         channel: "new message"
  #         data: "{{ greeting }}"
  #     - think: 60

  # - name: "A chatty user"
  #   weight: 10
  #   engine: "socketio"
  #   flow:
  #     - get:
  #         url: "/"
  #     - emit:
  #         channel: "add user"
  #         data: "chatty-{{ $randomString() }}"
  #     - emit:
  #         channel: "new message"
  #         data: "{{ greeting }}"
  #     - loop:
  #         - function: "setMessage"
  #         - emit:
  #             channel: "new message"
  #             data: "{{ message }}"
  #         - think: 10
  #       count: 10
  #     - think: 60